<%@ page language="java" contentType="text/html; charset=UTF-8" pageEncoding="UTF-8" %>
<%@ taglib prefix="c" uri="http://java.sun.com/jsp/jstl/core" %>
<c:set var="ctx" value="${pageContext['request'].contextPath}"/>

<!DOCTYPE html>
<html>
<head>
    <title>汤森机械网-一般条款</title>
    <%@ include file = "meta.jsp" %>
    <link rel="stylesheet" href="${ctx}/wap/css/module/index.css" type="text/css" charset="utf-8">
    <style>
    p{margin:0;text-indent:2.0em;font-size: 16px;line-height: 24px;}
    p.h{text-indent: 0;font-size:18px;line-height: 40px;}
    </style>
    
<body>
    <%@ include file="header.jsp" %>
    <div class="page-view" style="padding:20px 10px 0;background:#fff;">
    <p class="h" style="text-align: center;font-size: 32px;line-height: 60px;">
    一般条款
    </p>
    <p>
    欢迎使用汤森机械网通过www.tangsons.cn为您提供的网站服务（以下统称网站服务）,&nbsp;在使用汤森提供的服务前，您应认真详尽阅读本须知。您使用汤森机械网的行为将被视为您已充分阅读、理解并接受本须知的全部内容，并同意受本须知的约束。
    </p>
    <p>
    <br/>
    </p>
    <p class="h">
    1.&nbsp;网站服务说明
    </p>
    <p>
    网站服务是指为用户发布，搜索、购买和出售机械设备的网上交易平台。汤森机械网为其他单位或个人用户发布有关二手机械设备信息提供平台服务。汤森平台上用户或其发布的相关信息（包括但不限于商家信息、设备的型号、品牌、描述、说明和图片等）均由用户自行提供，汤森无需对该信息进行任何的查证、核实、评论和担保，该信息的发布者依法对其提供的所有信息独立承担全部责任。
    </p>
    <p>
    在汤森机械网上销售设备的协议一律由买家和卖家之间直接签订。汤森机械网不以任何方式参与交易和买卖合同的拟定。所有销售设备的细节由卖方提供，汤森机械网对于卖方在网站上发布的广告内容不负责任。
    </p>
    <p>
    所有发布在网站服务上的信息仅供参考。尽管汤森机械网希望卖家能够恪守诚信地使用网站服务，但汤森机械网不能保证由卖家提供的数据完全正确。在汤森机械网上购买设备之前，所有买家都有责任认真检查所有可能影响购买决定的因素。购买二手设备时，买家应当在如报纸等其它媒体上购买设备一样谨慎。
    </p>
    <p>
    如果您基于网站服务提供的数据信息决定购买设备或金融、运输服务时，您的合同签订对象均为卖家，而不是汤森机械网。
    </p>
    <p>
    <br/>
    </p>
    <p class="h">
    2.&nbsp;注册成为网站服务的用户
    </p>
    <p>
    如果您想成为汤森机械网站服务的用户，根据要求填入个人信息并同意服务条款。汤森机械网将会保存您提供的个人信息，下次登录的时候不需要重复提交。所有注册的用户必须不小于18岁。
    </p>
    <p>
    同意网站服务的服务条款，意味着您保证您提供的信息的真实性并同意若需要更改则以邮件方式及时通知汤森机械网。汤森机械网保留无理由拒绝注册的权力。如果您提供的信息不足或不真实，或您未通知汤森机械网而修改信息，汤森机械网将有权终止您的会员身份。若违反汤森机械网服务条款，汤森机械网有权拒绝您使用网站服务和注销您的账号。在法律允许的范围内，汤森机械网有权采用有利于自己的保护措施。
    </p>
    <p>
    使用网站服务必须有一个账户名和相匹配的密码，账户和密码必须安全保存，以防止他人未经授权使用。作为汤森机械网用户，一旦有第三方未经授权使用您的账号和密码，您必须第一时间以邮件形式通知汤森机械网。尽管您的账号被第三方盗用，但在收到您的信息之前，您仍然为您的网站服务账号和密码负责。
    </p>
    <p>
    <br/>
    </p>
    <p class="h">
    3.&nbsp;数据保护
    </p>
    <p>
    汤森机械网尊重用户隐私，并采取有力的合理的商业手段来保护用户在网站服务提供的个人信息以防其被不恰当使用。
    </p>
    <p>
    汤森机械网可能会使用并且披露用户信息（例如姓名、邮箱地址）给第三方，除非用户书面或邮件或电话通知汤森机械网说明禁止此披露。数据信息的接受者有配件供应商、附加产品和金融服务供应商或者其他与汤森产品同类型的设备服务商。这些数据信息仅在现有法律允许的范围之内传送。
    </p>
    <p>
    在我们的隐私政策中可以看到更多的信息，注册成为网站服务的用户意味您同意隐私条款中描述的信息使用条款。
    </p>
    <p>
    <br/>
    </p>
    <p class="h">
    4.&nbsp;信息发布
    </p>
    <p>
    您在汤森机械网上所发布的信息，都将视为要求汤森机械网将其发布在网站服务上面。在未经汤森机械网审核确认信息发布前，汤森机械网与用户没有任何契约关系。卖家有责任明确信息发布在相对应的类别的网站上面。
    </p>
    <p>
    网站服务的用户有责任确保自己有将信息发布到汤森机械网的权力。所发布的内容应保证不侵犯其他任何人或组织的知识产权和其它权力，确保不含有可能对汤森机械网造成损害的描述和材料。若广告内容不符合以上规定，用户必须全部赔偿汤森机械网的任何损失。
    </p>
    <p>
    如果发布的任何信息因某些原因不能在公共场合发布，汤森机械网将通过邮件联系卖家。根据汤森机械网审核，若有用户不正当或不礼貌使用网站服务，汤森机械网有权终止该买家或卖家使用网站服务。每个信息发布的先决条件是分别决定的。每一个信息可能仅适用于一台设备。&nbsp;
    </p>
    <p>
    卖家有责任在发布的信息中提供设备正确的数据信息以让买家充分了解设备。这些信息包括设备的状况和其它买家认为重要的并且符合法律法规的因素。您也将同意您在所发布的信息中提供的价格、保证以及其它信息。您有责任通知汤森机械网您的设备已经售出，因此您发布的信息可以移除。
    </p>
    <p>
    汤森机械网有权编辑、归类、复制您在网站服务中提交的材料并自由使用于这台设备的销售。汤森机械网有可能无法确保用户提供的信息的正确性，因此，错误信息极有可能对汤森机械网造成任何损失。
    </p>
    <p>
    在发布的任何过程中有可能被暂停。在发布信息之前删除信息，不会产生任何费用。由于汤森机械网索引资料和保护措施会产生一定的时间间隔，发布在汤森机械网的信息不会立即显示。索引数据间隔时间主要取决于服务器的载荷。通常信息在发布后会在几个小时内显示在网站上。为了保证我们的用户和访问者的安全，我们将对个人广告进行欺诈性、迷惑性以及违法性甄别和审查。这项检查有可能需要72小时，直到信息成功显示在网站上。
    </p>
    <p>
    <br/>
    </p>
    <p class="h">
    5.&nbsp;设备信息
    </p>
    <p>
    汤森机械网向用户强调，所有在汤森机械网上发布的设备信息都来源于卖家。设备状况是由卖家主观描述，因此只是卖家从自己的角度对设备的评价。设备的数据信息不是由独立的、中立的第三方提供的，汤森机械网不对此类信息的正确性负责。
    </p>
    <p>
    <br/>
    </p>
    <p class="h">
    6.&nbsp;知识产权
    </p>
    <p>
    用户同意所有汤森机械网上的文字、图片和项目材料都受相关的法律保护。汤森机械网拥有网站服务上所有材料的知识产权。用户不能出于商业目的利用、发布、加工、传播或以其它方式利用受保护的材料，除非得到汤森机械网明确出具的书面允许或受到法律强制。
    </p>
    <p>
    <br/>
    </p>
    <p class="h">
    7.&nbsp;免责条款
    </p>
    <p>
    本协议不对网站资料内容的准确性做出任何声明或保证。汤森机械网拥有自行决定限制或禁止任何一方登录本网站任何部分的权利。
    </p>
    <p>
    鉴于汤森机械网属于信息发布平台，出于传递信息的目的而提供服务，汤森机械网对平台上发布的信息不作任何明示或暗示的保证，不参与或介入由此信息相关或衍生出的交易。您应谨慎判断相关信息的真实性、及时性、合法性和准确性，合理使用相关信息，并详尽了解设备具体情况，以自愿达成相关交易。如果您无法对相关信息进行正确合理判断，汤森机械网提醒您对相关信息进一步核查，谨慎交易。同时，汤森机械网提醒您，注意保留相关交易证据和凭证，以利于您之后的维权。
    </p>
    <p>
    您了解并同意，因使用汤森机械网及在汤森机械网上的信息而产生的结果自行承担风险，并免于汤森机械网因此产生的任何损失和责任。汤森机械网及其运营者不对因使用汤森机械网而可能遭受的意外、疏忽、侵权或其他损失损害负责，亦不承担任何责任。
    </p>
    <p>
    此外，汤森机械网不保证网站服务不会出现操作错误，以及不能保证汤森机械网的服务器不会受到病毒或其它有害机制的攻击。如果因为网站服务的使用导致需要服务或需要更换设备或者数据信息，汤森机械网将不负责此类费用。网站服务按照实际情况运行，汤森机械网不负责由使用网站服务或网站服务的故障而导致的费用。
    </p>
    <p>
    如果付费服务中汤森机械网造成错误，汤森机械网可选择更正错误或者退还用户的广告费用。退还的费用最多与用户支付此项服务的费用一样。汤森机械网不负责由用户自己造成或第三方造成的损失，以及不负责汤森机械网不能合理预见的损失。
    </p>
    <p>
    在网站服务上有独立于汤森机械网之外的其它外部服务商发布的链接。尽管汤森机械网向您提供这些链接，但需要指出的是，这些链接是由相关的服务供应商提供的，不可用于这些服务商规定之外的地方。汤森机械网不会为其它服务商的产品或服务负任何责任。
    </p>
    <p>
    <br/>
    </p>
    <p class="h">
    8.&nbsp;可行性
    </p>
    <p>
    汤森机械网有权在不事先告知的情况下，对网站全部或者部分服务、操作时间、技术性细节以及其他内容进行改变、移动或者其他变动。汤森机械网有权因网站维护和其他原因临时暂停使用。
    </p>
    <p>
    <br/>
    </p>
    <p class="h">
    9.&nbsp;条款修订
    </p>
    <p>
    网站服务提供的内容在不断演变，因此汤森机械网拥有修改服务条款的权力。这些条款的修订在生效之前会发布在网站上或通过电子邮件发送给用户。网站服务（包括电子邮件）的修订条款将在30天内生效。如果在修订之后您仍继续使用本站服务，您必须确认新的条款对您仍有约束力，尽管在这之前您就已经注册成为用户。
    </p>
    <p>
    <br/>
    </p>
    <p class="h">
    10.&nbsp;反馈
    </p>
    <p>
    如果您认为汤森机械网上某一信息虚假不实或涉嫌侵权，您应及时向汤森机械网提出书面通知，并提供身份证明、相关信息虚假不实的证明以及侵权的详细情况说明和证据。汤森机械网在收到上述书面通知和完整的文件后，将会尽快进行调查，依法删除相关信息内容。
    </p>
    <p>
    如果您对网站本身的任何内容有任何意见和建议，欢迎指出。您可以并点击首页的“反馈信息”填写反馈意见和建议。请在信息中描述出相关的不足。
    </p>
    <p>
    <br/>
    </p>
    <p class="h">
    11.&nbsp;无效条款
    </p>
    <p>
    如果条款中有任何一项被认为无效，所有剩余条款将仍然有效。
    </p>
    <p>
    <br/>
    </p>
    <p class="h">
    12.&nbsp;不可抗力
    </p>
    <p>
    对于因超出一方合理控制范围，并在签订协议时不可预见而导致合同义务无法执行的事件(如罢工、停工、电讯故障、火灾、盗窃、水灾、破坏活动和暴乱或其他任何类似意外事件)，该方无需承担责任。
    </p>
    <p>
    <br/>
    </p>
    <p class="h">
    13.&nbsp;有效期
    </p>
    <p>
    这些条款将在您接受之后开始无限期生效直到进一步通知。如果用户违背条款内容、干扰其他用户或服务的使用，汤森机械网可以随时终止该用户的使用权。
    </p>
    <p>
    <br/>
    </p>
    <p class="h">
    14&nbsp;提前终止
    </p>
    <p>
    除另有规定外，任何一方可发出通知取消协议，即时生效：<br/>a)&nbsp;任何一方从根本上违反本协议规定义务，并未能在提出书面请求后30日内进行补救。&nbsp;<br/>b)&nbsp;任何一方暂停付款、试图分期付款、破产、受到扣押或其他类似的情况发生，可以合理地视为破产或清算的证据。
    </p>
    <p class="h">
    <br/>15.&nbsp;纠纷解决及适用法律
    </p>
    <p>
    本协议适用于中国法律，不包括其选择的法律规定。任何争议、纠纷或索赔而导致的违反协议、协议终止及由此改变的有效期，最终解释权归汤森机械网注册所在地管辖的法院。
    </p>
    <p>
    <br/>
    </p>
    </div>
    <%@ include file="footer.jsp" %>
</body></html>
